In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [2]:
os.getcwd()

'/mnt/c/Users/Usuario/Desktop'

In [3]:
os.chdir("pairs_modulo_2/promo_d_da_modulo2_sprint2_Silvia_Paula/")

In [4]:
df_bank = pd.read_csv("datos/bank-additional-full-edit1.csv", index_col= 0)
df_bank

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,month_day_week
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
4,56,services,married,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,0.0,1.0,0.0,cellular,334,1,999,0,NONEXISTENT,-1.1,94.767,-50.8,1.028,4963.6,yes,"['nov', 'fri']"
41184,46,blue-collar,married,professional.course,0.0,0.0,0.0,cellular,383,1,999,0,NONEXISTENT,-1.1,94.767,-50.8,1.028,4963.6,no,"['nov', 'fri']"
41185,56,retired,married,university.degree,0.0,1.0,0.0,cellular,189,2,999,0,NONEXISTENT,-1.1,94.767,-50.8,1.028,4963.6,no,"['nov', 'fri']"
41186,44,technician,married,professional.course,0.0,0.0,0.0,cellular,442,1,999,0,NONEXISTENT,-1.1,94.767,-50.8,1.028,4963.6,yes,"['nov', 'fri']"
41187,74,retired,married,professional.course,0.0,1.0,0.0,cellular,239,3,999,1,FAILURE,-1.1,94.767,-50.8,1.028,4963.6,no,"['nov', 'fri']"

Columnas loan, housing y default: estas columnas contienen valores únicos de 0 y 1. Esto puede parecer poco intuitivo a la hora de la extracción de conclusiones y en las visualizaciones.

El objetivo de este ejercicio es que cambies los valores númericos por "Si" y "No". A que corresponde cada uno de los valores lo tenéis en el pair de Limpieza I.

In [5]:
mapa = {0: "No",
       1: "Si"}

In [6]:
df_bank["loan2"] = df_bank["loan"].map(mapa, na_action="ignore")

In [7]:
df_bank["housing2"] = df_bank["housing"].map(mapa, na_action="ignore")

In [8]:
df_bank["default2"] = df_bank["default"].map(mapa, na_action="ignore")

In [9]:
df_bank[df_bank["default"] == 1.0]

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,month_day_week,loan2,housing2,default2
21580,48,technician,married,professional.course,1.0,0.0,0.0,cellular,66,1,...,1.4,93.444,-36.1,4.963,5228.1,no,"['aug', 'tue']",No,No,Si
21581,48,technician,married,professional.course,1.0,1.0,0.0,cellular,133,1,...,1.4,93.444,-36.1,4.963,5228.1,no,"['aug', 'tue']",No,Si,Si
24866,31,unemployed,married,high.school,1.0,0.0,0.0,cellular,111,2,...,-0.1,93.200,-42.0,4.153,5195.8,no,"['nov', 'tue']",No,No,Si

In [10]:
df_bank.sample(5)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,month_day_week,loan2,housing2,default2
37218,29,admin.,single,university.degree,0.0,0.0,0.0,cellular,289,2,...,-2.9,92.201,-31.4,0.881,5076.2,yes,"['aug', 'fri']",No,No,No
16507,22,blue-collar,single,high.school,0.0,1.0,0.0,cellular,123,2,...,1.4,93.918,-42.7,4.963,5228.1,no,"['jul', 'wed']",No,Si,No
37410,66,retired,married,NaN,0.0,0.0,0.0,cellular,147,2,...,-2.9,92.201,-31.4,0.879,5076.2,yes,"['aug', 'wed']",No,No,No
25219,41,technician,married,basic.9y,0.0,1.0,0.0,telephone,102,2,...,-0.1,93.200,-42.0,4.153,5195.8,no,"['nov', 'tue']",No,Si,No
12656,31,technician,married,high.school,0.0,0.0,0.0,cellular,75,3,...,1.4,93.918,-42.7,4.960,5228.1,no,"['jul', 'mon']",No,No,No

Para la columna de education, si nos fijamos en sus valores únicos veremos que tenemos puntos. 

El objetivo de este ejercicio es que quitéis los puntos de esos valores y los reemplacéis por espacios.

In [11]:
df_bank["education2"] = df_bank.apply(lambda df_bank: df_bank["education"].replace(".", " ") if type(df_bank["education"]) == str else df_bank["education"], axis = 1)

In [12]:
df_bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,month_day_week,loan2,housing2,default2,education2
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,...,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,No,basic 4y
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,...,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,NaN,high school
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,...,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",No,Si,No,high school
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,...,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,No,basic 6y
4,56,services,married,high.school,0.0,0.0,1.0,telephone,307,1,...,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",Si,No,No,high school

Para la columna job, hay un valor único que esta abreviado (admin.), cambiad la abreviatura por el nombre completo.

In [13]:
df_bank["job2"] = df_bank.apply(lambda df_bank: df_bank["job"].replace("admin.", "administrativo") if type(df_bank["job"]) == str else df_bank["job"], axis = 1)

In [14]:
df_bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,cons_conf_idx,euribor3m,nr_employed,y,month_day_week,loan2,housing2,default2,education2,job2
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,...,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,No,basic 4y,housemaid
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,...,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,NaN,high school,services
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,...,-36.4,4.857,5191.0,no,"['may', 'mon']",No,Si,No,high school,services
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,...,-36.4,4.857,5191.0,no,"['may', 'mon']",No,No,No,basic 6y,administrativo
4,56,services,married,high.school,0.0,0.0,1.0,telephone,307,1,...,-36.4,4.857,5191.0,no,"['may', 'mon']",Si,No,No,high school,services

La columna month_day_week tiene una lista que contiene información muy diferente. 

El objetivo de este ejercicio es separar esta columna en dos nuevas, donde tengamos los meses en una columna y los días de la semana en otra.

In [15]:
df_bank[['month','day_week']] = df_bank['month_day_week'].str.split(',', expand=True, n=1)

In [16]:
df_bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,nr_employed,y,month_day_week,loan2,housing2,default2,education2,job2,month,day_week
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,...,5191.0,no,"['may', 'mon']",No,No,No,basic 4y,housemaid,['may','mon']
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,...,5191.0,no,"['may', 'mon']",No,No,NaN,high school,services,['may','mon']
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,...,5191.0,no,"['may', 'mon']",No,Si,No,high school,services,['may','mon']
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,...,5191.0,no,"['may', 'mon']",No,No,No,basic 6y,administrativo,['may','mon']
4,56,services,married,high.school,0.0,0.0,1.0,telephone,307,1,...,5191.0,no,"['may', 'mon']",Si,No,No,high school,services,['may','mon']

Guarda el csv con las columnas limpias para seguir trabajando con este dataframe limpio.

In [17]:
df_bank.to_csv("datos/bank-additional-full-edit2.csv")